# ExternalResourceLoadData Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExternalResourceLoadData Methods
ExternalResourceLoadData Class See Also
---
The ExternalResourceLoadData type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetExternalResourceReference | Returns the ExternalResourceReference that identifies which resource should be loaded. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetLoadContent | Returns the ExternalResourceLoadContent resulting from this load operation. |
| GetLoadContext | Returns an object containing information about the context of the load operation. |
| GetLoadRequestId | Returns the load operation GUID. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
ExternalResourceLoadData Class
Autodesk.Revit.DB Namespace